# 2883. Drop Missing Data
[問題](https://leetcode.com/problems/drop-missing-data/?envType=study-plan-v2&envId=introduction-to-pandas&lang=pythondata)

In [1]:
import pandas as pd

In [2]:
def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    students.dropna(subset="name", inplace=True)
    return students

In [4]:
students_data = [[32,"Piper",5],[217,None,19],[779,"Georgia",20],[849,"Willow",14]]

headers = ["student_id","name","age"]

In [8]:
students = pd.DataFrame(students_data, columns=headers)

In [9]:
students

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [10]:
dropMissingData(students)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14